
TEST_TARGET_POOL =[
    ('품목명','품종명','거래단위','등급'),
    ('건고추', '화건', '30 kg', '상품'),
    ('사과','홍로, 후지','10 개','상품'),
    ('감자','감자 수미','20키로상자','상'),
    ('배','신고','10 개','상품'),
    ('깐마늘(국산)','깐마늘(국산)','20 kg','상품'),
    ('무','무','20키로상자','상'),
    ('상추','청','100 g','상품'),
    ('배추','배추','10키로망대','상'),
    ('양파','양파','1키로','상'),
    ('대파','대파(일반)','1키로단','상')
]

ITEM_ENUM = {
    '건고추': 1,
    '사과': 2,
    '감자': 3,
    '배': 4,
    '깐마늘(국산)': 5,
    '무': 6,
    '상추': 7,
    '배추': 8,
    '양파': 9,
    '대파': 10
}

GRADE_ENCODING = {
    '특': 3,
    '상': 2,
    '중': 1,
    '하': 0,
    '상품': 2,
    '중품': 1
}


